public class Main {
    public static void main(String[] args) {

        // 1) десятичная система исчисления
        // 16 -> 10
        // число 333  ( 3 * 16^2) + (3*16^1) + (3* 16^0) = 819
        // 2) Разложить число 200345 на разряды в десятичной системе
        // ( 2 * 10 ^ 4) + ( 3 * 10 ^ 2) + ( 4 * 10 ^1) + ( 5 * 10 ^0)
        // 10 -> 16  (637)
        // 637/ 16 = 39 ( целое)  13 - остаток
        // 39/16 = 2 ( целое) 7 - остаток
        // 2/16 = 0 (целое) 2/16 = 1 остаток
        // число 17 D

        // 2) 16 -> 10 (637)
        // ( 6 * 16^2) + ( 3 * 16^1) + (7 * 16^0)  = 256 * 6 = 1536 + 48 + 7 = 1591
        // 3) 10 -> 2
        // 637 / 2 = 318 / Ост 1
        // 318 / 2 = 159 / ост 0
        // 159 / 2 = 79 / ост 1
        // 79 / 2 = 39 / ост 1
        // 39 / 2 = 19 / ост 1
        // 19 / 2 = 9 / ост 1
        // 9 / 2 = 4 / ост 1
        // 4 / 2 = 2 / ост 0
        // 2/2 = 1 / ост 0
        // 1/2 = 0 ост 1
        // = 1001111101
        // 4) 11100111 = ( 1 * 2^7) + ( 1 * 2^6) + ( 1 * 2^5) + ( 1* 2^4) + (1* 2^3) + (1* 2^2) + ( 1*  2^1) + ( 1* 2^0)
        // 128+ 64 + 32 + 16+ 8 + 4 * 2 + 0 = 254
        //

        // 5) 10 -> 3  ( 637)
        // 637 / 3  ост 1
        // 212/ 3 70, 6  ост 2
        // 70 / 3  23  ост 1
        // 23 / 3 целое 7. ост 2
        // 7 / 3 целое 2 ост 1
        // 2 / 3 целое 0 ост 2
        // 212121
        //
        //
        //
        //
        //
        //
        //
        //

        System.out.println("Hello world!");
    }
}